---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcLengthDimensionReferencesNotIntersect
source: html/f1314237-4eff-c659-622b-2e526454261b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcLengthDimensionReferencesNotIntersect Property

One or more dimension references of this Arc Length dimension no longer intersect the circle needed for arc length computation.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArcLengthDimensionReferencesNotIntersect { get; }
```